УНФ_ТЕСТ/src/Documents/ЗаказМП/ЗаказМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказМП</name>
  <basedOn>Catalog.КонтрагентыМП</basedOn>
  <basedOn>Catalog.ТоварыМП</basedOn>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.КонтрагентыМП</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостоянияЗаказовМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзЦентральнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгруженУстановленВЦентральнойБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченУстановленВЦентральнойБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКартой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.ТоварыМП</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/AccumulationRegisters/ОстаткиТоваровМП/ОстаткиТоваровМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваровМП</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ТоварныеОперацииМП</types>
    </type>
  </attributes>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.ТоварыМП</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УНФ_ТЕСТ/src/Enums/ВидыТоваровМП/ВидыТоваровМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТоваровМП</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/СостоянияЗаказовМП/СостоянияЗаказовМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовМП</name>
  <enumValues>
    <name>Открыт</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Documents/РасходТовараМП/РасходТовараМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходТовараМП</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентамиМП</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваровМП</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиМП</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.КонтрагентыМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказМП</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.ТоварыМП</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/Documents/ПриходДенегМП/ПриходДенегМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенегМП</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентамиМП</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваМП</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентыМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказМП</types>
      <types>DocumentRef.РасходТовараМП</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСменыККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧекаККМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусЧекаККММП</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКартой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАвторизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылочныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПлатежнойКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>24</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперацииЭТ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СлипЧек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

УНФ_ТЕСТ/src/Documents/ЗаказМП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбщегоНазначения

Процедура ЗаполнитьОтгрузку() Экспорт
	
	Если НЕ Отгружен Тогда
		ОбщегоНазначенияМПСервер.УдалитьСвязанныеДокументы("РасходТовараМП", Ссылка);
		Возврат;
	КонецЕсли;
	
	НайденнаяСсылка = Документы.РасходТовараМП.НайтиПоРеквизиту("Основание", Ссылка);
	Если НайденнаяСсылка.Пустая() Тогда
		РасходОбъект = Документы.РасходТовараМП.СоздатьДокумент();
		РасходОбъект.Дата = ТекущаяДата();
		РасходОбъект.УстановитьНовыйНомер();
	Иначе
		РасходОбъект = НайденнаяСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	РасходОбъект.СуммаСкидки = СуммаСкидки;
	РасходОбъект.СуммаДокумента = СуммаДокумента;
	РасходОбъект.Покупатель = Покупатель;
	РасходОбъект.Основание = Ссылка;
	
	ТаблицаТоваров = Товары.Выгрузить();
	РасходОбъект.Товары.Загрузить(ТаблицаТоваров);
	
	Если ОбменДанными.Загрузка Тогда
		РасходОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	КонецЕсли;
	
	Если РасходОбъект.ПометкаУдаления<> ПометкаУдаления Тогда
		РасходОбъект.Записать();
		РасходОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	КонецЕсли;
	
	Если Проведен Тогда
		РасходОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли РасходОбъект.Проведен Тогда
		РасходОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Иначе
		РасходОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОплату() Экспорт
	
	Если ДополнительныеСвойства.Свойство("ПринудительноСформироватьДокументОплаты") Тогда
	Иначе
		Если СуммаОплаты = 0 Тогда
			ОбщегоНазначенияМПСервер.УдалитьСвязанныеДокументы("ПриходДенегМП", Ссылка);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НайденнаяСсылка = Документы.ПриходДенегМП.НайтиПоРеквизиту("Основание", Ссылка);
	Если НайденнаяСсылка.Пустая() Тогда
		ОплатаОбъект = Документы.ПриходДенегМП.СоздатьДокумент();
		ОплатаОбъект.Дата = ТекущаяДата();
		ОплатаОбъект.УстановитьНовыйНомер();
	Иначе
		ОплатаОбъект = НайденнаяСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОплатаОбъект.Статья)
		И ОбщегоНазначенияМПСервер.ЕстьПредопределенныйВДанных("СтатьиМП", "ОплатаОтПокупателя") Тогда
		ОплатаОбъект.Статья = Справочники.СтатьиМП.ОплатаОтПокупателя;
	КонецЕсли;
	ОплатаОбъект.Сумма = СуммаОплаты;
	ОплатаОбъект.Контрагент = Покупатель;
	ОплатаОбъект.Основание = Ссылка;
	
	Если ОбменДанными.Загрузка Тогда
		ОплатаОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	КонецЕсли;
	
	Если ОплатаОбъект.ПометкаУдаления <> ПометкаУдаления Тогда
		ОплатаОбъект.Записать();
		ОплатаОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	КонецЕсли;
	
	Если Проведен Тогда
		ОплатаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли ОплатаОбъект.Проведен Тогда
		ОплатаОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Иначе
		ОплатаОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗапретитьОперацииСоСвязанымиДокументами")
		И ДополнительныеСвойства.ЗапретитьОперацииСоСвязанымиДокументами Тогда
	ИначеЕсли НЕ Ссылка.Пустая() Тогда
		НайденнаяСсылка = Документы.РасходТовараМП.НайтиПоРеквизиту("Основание", Ссылка);
		Если НЕ НайденнаяСсылка.Пустая() Тогда
			РасходОбъект = НайденнаяСсылка.ПолучитьОбъект();
			РасходОбъект.ДополнительныеСвойства.Вставить("ЗапретитьОперацииСоСвязанымиДокументами", Истина);
			РасходОбъект.ДополнительныеСвойства.Вставить("ЗапретитьПовторныйЗапускОбмена", Истина);
			РасходОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма") - СуммаСкидки;
	
	Если Отгружен 
		И НЕ ОтгруженУстановленВЦентральнойБазе
		И РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ Константы.НеКотролироватьОстаткиМП.Получить() Тогда
		
		Остатки = РегистрыНакопления.ОстаткиТоваровМП.Остатки();
		
		НайденнаяСсылка = Документы.РасходТовараМП.НайтиПоРеквизиту("Основание", Ссылка);
		ДвиженияПоОтгрузке = РегистрыНакопления.ОстаткиТоваровМП.ВыбратьПоРегистратору(НайденнаяСсылка);
		
		Для каждого СтрокаЗаказа Из Товары Цикл
			
			Если СтрокаЗаказа.Товар.Вид = Перечисления.ВидыТоваровМП.Товар Тогда
				
				НайденнаяСтрокаОстатков = Остатки.Найти(СтрокаЗаказа.Товар, "Товар");
				Если НайденнаяСтрокаОстатков = Неопределено Тогда
					КоличествоНаСкладе = 0;
				Иначе
					КоличествоНаСкладе = НайденнаяСтрокаОстатков.Количество;
				КонецЕсли;
				
				Пока ДвиженияПоОтгрузке.Следующий() Цикл
					Если СтрокаЗаказа.Товар = ДвиженияПоОтгрузке.Товар Тогда
						КоличествоНаСкладе = КоличествоНаСкладе + ?(ДвиженияПоОтгрузке.ВидДвижения = ВидДвиженияНакопления.Расход, 1, -1) * ДвиженияПоОтгрузке.Количество;
					КонецЕсли;
				КонецЦикла;
				
				Если КоличествоНаСкладе < СтрокаЗаказа.Количество
					И НЕ ДополнительныеСвойства.Свойство("НеКонтролироватьОстатки") Тогда
					СтрокаОшибки = НСтр("ru='На складе нет достаточного количества остатков товара:"
					"%Товар%. Не хватает %Количество%';en='In stock do not have enough residual item:"
					"%Товар%. Not enough %Количество%'");
					СтрокаОшибки = СтрЗаменить(СтрокаОшибки, "%Товар%", СокрЛП(СтрокаЗаказа.Товар));
					СтрокаОшибки = СтрЗаменить(СтрокаОшибки, "%Количество%", СокрЛП(СтрокаЗаказа.Количество - КоличествоНаСкладе));
					ОбщегоНазначенияМПКлиентСервер.СообщитьПользователю(СтрокаОшибки, , Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отгружен И Оплачен Тогда
		СостояниеЗаказа = Перечисления.СостоянияЗаказовМП.Выполнен;
	Иначе
		СостояниеЗаказа = Перечисления.СостоянияЗаказовМП.ВРаботе;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//МассивУзловДляРегистрации = Новый Массив;
	//
	//Выборка = ПланыОбмена.МобильноеПриложение.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Ссылка <> ПланыОбмена.МобильноеПриложение.ЭтотУзел() Тогда
	//		//Если НЕ ИзЦентральнойБазы Тогда
	//			МассивУзловДляРегистрации.Добавить(Выборка.Ссылка);
	//		//КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если МассивУзловДляРегистрации.Количество() > 0 Тогда
	//	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловДляРегистрации, Ссылка);
	//КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗапретитьОперацииСоСвязанымиДокументами")
		И ДополнительныеСвойства.ЗапретитьОперацииСоСвязанымиДокументами Тогда
	Иначе
		ЗаполнитьОтгрузку();
		ЗаполнитьОплату();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Отгружен = Ложь;
	Оплачен = Ложь;
	ИзЦентральнойБазы = Ложь;
	ОтгруженУстановленВЦентральнойБазе = Ложь;
	ОплаченУстановленВЦентральнойБазе = Ложь;
	Комментарий = "";
	СуммаОплаты = 0;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
